Учет_кабельной_продукции/src/Documents/ЗаданияНаЗакупку/ЗаданияНаЗакупку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаданияНаЗакупку</name>
  <posting>Deny</posting>
  <registerRecords>InformationRegister.ЗаданияНаЗакупкиСтатусы</registerRecords>
  <attributes>
    <name>Подрядчик</name>
    <type>
      <types>CatalogRef.Подрядчик</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>199</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>EnumRef.СтатусыЗаданийНаЗакупку</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КабельныеЛинии</name>
    <attributes>
      <name>ЖурналУчетаКП</name>
      <type>
        <types>CatalogRef.ЖурналыУчетаКабельнойПродукции</types>
      </type>
    </attributes>
    <attributes>
      <name>КабельнаяЛиния</name>
      <type>
        <types>CatalogRef.КабельныеЛинии</types>
      </type>
    </attributes>
    <attributes>
      <name>Принято</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>199</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Учет_кабельной_продукции/src/Documents/ЗаявкиНаЗакупки/ЗаявкиНаЗакупки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкиНаЗакупки</name>
  <posting>Deny</posting>
  <registerRecords>InformationRegister.ДанныеПоЗаявкамНаЗакупку</registerRecords>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаявкиНаЗакупку</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подрядчик</name>
    <type>
      <types>CatalogRef.Подрядчик</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>299</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КабельныеЛинии</name>
    <attributes>
      <name>ЖурналУчетаКП</name>
      <type>
        <types>CatalogRef.ЖурналыУчетаКабельнойПродукции</types>
      </type>
    </attributes>
    <attributes>
      <name>КабельнаяЛиния</name>
      <type>
        <types>CatalogRef.КабельныеЛинии</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерВКНаКПП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>299</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Учет_кабельной_продукции/src/Documents/ЗаявкаНаМонтаж/ЗаявкаНаМонтаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаМонтаж</name>
  <basedOn>Catalog.ЖурналыУчетаКабельнойПродукции</basedOn>
  <posting>Deny</posting>
  <registerRecords>InformationRegister.ЗаявкиНаМонтажСтатусы</registerRecords>
  <registerRecords>InformationRegister.ДанныеПоЗаданиямПоПрокладкеКабелей</registerRecords>
  <registerRecords>InformationRegister.РазрешениеМонтажаКПП</registerRecords>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаявкиНаМонтаж</types>
    </type>
  </attributes>
  <attributes>
    <name>Подрядчик</name>
    <type>
      <types>CatalogRef.Подрядчик</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачиВМонтаж</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтчетаОМонтаже</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КабельныеЛинии</name>
    <attributes>
      <name>ЖурналУчетаКП</name>
      <type>
        <types>CatalogRef.ЖурналыУчетаКабельнойПродукции</types>
      </type>
    </attributes>
    <attributes>
      <name>КабельнаяЛиния</name>
      <type>
        <types>CatalogRef.КабельныеЛинии</types>
      </type>
    </attributes>
    <attributes>
      <name>РазрешитьМонтаж</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗапретитьМонтаж</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Учет_кабельной_продукции/src/CommonModules/КонтрольУдаленияДокументовСервер/Module.bsl
Процедура ПроверитьЕстьСвязанныеДокументыПередПометкойУдаления(Ссылка, СписокСвязанныхДокументов, Отказ) Экспорт

	Если СписокСвязанныхДокументов.Количество() > 0 Тогда 
		
		Отказ = Истина;
		ТекстСообщения = СтрШаблон("Нельзя удалить текущий документ %1, есть связанные документы: ", Ссылка);
		Для Каждого ТекДокумент Из СписокСвязанныхДокументов Цикл 
			ТекстСообщения = ТекстСообщения + Символы.ПС + ТекДокумент; 
		КонецЦикла;	 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
	КонецЕсли;

КонецПроцедуры

Функция ПолучитьСвязанныеДокументыЗаданияНаЗакупки(СписокЗаданийНаЗакупки) Экспорт
	
	УстановитьПривилегированныйРежим(ИСтина);	
	Запрос       = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаданияНаЗакупку.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ВТ_УдаляемыеЗаданияНаЗакупки
	               |ИЗ
	               |	Документ.ЗаданияНаЗакупку КАК ЗаданияНаЗакупку
	               |ГДЕ
	               |	ЗаданияНаЗакупку.Ссылка В(&СписокЗаданийНаЗакупки)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЗаданияНаЗакупкуКабельныеЛинии.ЖурналУчетаКП КАК ЖурналУчетаКП,
	               |	ЗаданияНаЗакупкуКабельныеЛинии.КабельнаяЛиния КАК КабельнаяЛиния
	               |ПОМЕСТИТЬ ВТ_КабельныеЛинииУдаляемыхЗаданийНаЗакупки
	               |ИЗ
	               |	ВТ_УдаляемыеЗаданияНаЗакупки КАК ВТ_УдаляемыеЗаданияНаЗакупки
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаданияНаЗакупку.КабельныеЛинии КАК ЗаданияНаЗакупкуКабельныеЛинии
	               |		ПО ВТ_УдаляемыеЗаданияНаЗакупки.Ссылка = ЗаданияНаЗакупкуКабельныеЛинии.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЗаявкиНаЗакупкиКабельныеЛинии.Ссылка КАК ЗаявкаНаЗакупки
	               |ПОМЕСТИТЬ ВТ_СвязанныеЗаявкиНаЗакупки
	               |ИЗ
	               |	Документ.ЗаявкиНаЗакупки.КабельныеЛинии КАК ЗаявкиНаЗакупкиКабельныеЛинии
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КабельныеЛинииУдаляемыхЗаданийНаЗакупки КАК ВТ_КабельныеЛинииУдаляемыхЗаданийНаЗакупки
	               |		ПО (ВТ_КабельныеЛинииУдаляемыхЗаданийНаЗакупки.ЖурналУчетаКП = ЗаявкиНаЗакупкиКабельныеЛинии.ЖурналУчетаКП)
	               |			И ЗаявкиНаЗакупкиКабельныеЛинии.КабельнаяЛиния = ВТ_КабельныеЛинииУдаляемыхЗаданийНаЗакупки.КабельнаяЛиния
	               |			И (НЕ ЗаявкиНаЗакупкиКабельныеЛинии.Ссылка.ПометкаУдаления)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗаявкаНаМонтажКабельныеЛинии.Ссылка КАК ЗаявкаНаМонтаж
	               |ПОМЕСТИТЬ ВТ_ЗаявкиНаМонтаж
	               |ИЗ
	               |	ВТ_КабельныеЛинииУдаляемыхЗаданийНаЗакупки КАК ВТ_КабельныеЛинииУдаляемыхЗаданийНаЗакупки
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаМонтаж.КабельныеЛинии КАК ЗаявкаНаМонтажКабельныеЛинии
	               |		ПО (НЕ ЗаявкаНаМонтажКабельныеЛинии.Ссылка.ПометкаУдаления)
	               |			И ВТ_КабельныеЛинииУдаляемыхЗаданийНаЗакупки.ЖурналУчетаКП = ЗаявкаНаМонтажКабельныеЛинии.ЖурналУчетаКП
	               |			И ВТ_КабельныеЛинииУдаляемыхЗаданийНаЗакупки.КабельнаяЛиния = ЗаявкаНаМонтажКабельныеЛинии.КабельнаяЛиния
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_СвязанныеЗаявкиНаЗакупки.ЗаявкаНаЗакупки КАК СвязанныйДокумент
	               |ИЗ
	               |	ВТ_СвязанныеЗаявкиНаЗакупки КАК ВТ_СвязанныеЗаявкиНаЗакупки
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВТ_ЗаявкиНаМонтаж.ЗаявкаНаМонтаж
	               |ИЗ
	               |	ВТ_ЗаявкиНаМонтаж КАК ВТ_ЗаявкиНаМонтаж";
	
	Запрос.УстановитьПараметр("СписокЗаданийНаЗакупки", СписокЗаданийНаЗакупки);
	Результат = Запрос.Выполнить().Выгрузить();
	СписокСвязанныхДокументов = Результат.ВыгрузитьКолонку("СвязанныйДокумент");
	
	Возврат СписокСвязанныхДокументов;
	
КонецФункции

Функция ПолучитьСвязанныеДокументыЗаявкиНаЗакупки(СписокЗаявокНаЗакупки) Экспорт
	
	УстановитьПривилегированныйРежим(ИСтина);	
	Запрос       = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаявкиНаЗакупки.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ВТ_УдаляемыеЗаданияНаЗакупки
	               |ИЗ
	               |	Документ.ЗаявкиНаЗакупки КАК ЗаявкиНаЗакупки
	               |ГДЕ
	               |	ЗаявкиНаЗакупки.Ссылка В(&СписокЗаявокНаЗакупки)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЗаявкиНаЗакупкиКабельныеЛинии.ЖурналУчетаКП КАК ЖурналУчетаКП,
	               |	ЗаявкиНаЗакупкиКабельныеЛинии.КабельнаяЛиния КАК КабельнаяЛиния
	               |ПОМЕСТИТЬ ВТ_КабельныеЛинииУдаляемыхЗаявкиНаЗакупки
	               |ИЗ
	               |	ВТ_УдаляемыеЗаданияНаЗакупки КАК ВТ_УдаляемыеЗаданияНаЗакупки
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкиНаЗакупки.КабельныеЛинии КАК ЗаявкиНаЗакупкиКабельныеЛинии
	               |		ПО ВТ_УдаляемыеЗаданияНаЗакупки.Ссылка = ЗаявкиНаЗакупкиКабельныеЛинии.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЗаявкаНаМонтажКабельныеЛинии.Ссылка КАК ЗаявкаНаМонтаж
	               |ПОМЕСТИТЬ ВТ_ЗаявкиНаМонтаж
	               |ИЗ
	               |	ВТ_КабельныеЛинииУдаляемыхЗаявкиНаЗакупки КАК ВТ_КабельныеЛинииУдаляемыхЗаявкиНаЗакупки
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаМонтаж.КабельныеЛинии КАК ЗаявкаНаМонтажКабельныеЛинии
	               |		ПО (НЕ ЗаявкаНаМонтажКабельныеЛинии.Ссылка.ПометкаУдаления)
	               |			И ВТ_КабельныеЛинииУдаляемыхЗаявкиНаЗакупки.ЖурналУчетаКП = ЗаявкаНаМонтажКабельныеЛинии.ЖурналУчетаКП
	               |			И ВТ_КабельныеЛинииУдаляемыхЗаявкиНаЗакупки.КабельнаяЛиния = ЗаявкаНаМонтажКабельныеЛинии.КабельнаяЛиния
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ЗаявкиНаМонтаж.ЗаявкаНаМонтаж КАК СвязанныйДокумент
	               |ИЗ
	               |	ВТ_ЗаявкиНаМонтаж КАК ВТ_ЗаявкиНаМонтаж";
	
	Запрос.УстановитьПараметр("СписокЗаявокНаЗакупки", СписокЗаявокНаЗакупки);
	Результат = Запрос.Выполнить().Выгрузить();
	СписокСвязанныхДокументов = Результат.ВыгрузитьКолонку("СвязанныйДокумент");
	
	Возврат СписокСвязанныхДокументов;
	
КонецФункции
